# кортеж tuple()

t1 = ()

t2 = (1,2,3,4,5, '23322', '23322','23322','23322',True, [1,2,3])

# print(t2)

# t2.count() - кількість входження елементу в кортеж

# print(t2.index('23322'))# - повертає індекс першого входження елемента



#множина set()

s1 = set('hello')

s3 = set()
# print(s1)

s2 = {1,2,3,4,5,6,7}
# print(s2)

s2.add(8) # додає елемент в множину
# print(s2)

# s2.clear() # очищає множину
# print(s2)

s4 = s2.copy() #копіює множину
# print(s4 == s2)

# print(s2.pop()) # видаляє перший елемент множини
# print(s2)

s2 = {1,2,3,4,5,6,7}
# s2.remove(9) # видаляє елемент. повертає помилку, якщо такого елемента немає в множині
# print(s2)

# s2.discard() # видаляє елемент з множини. не повертає помилку, якщо елемента нема

s2.discard(9)
# print(s2)



# словники dict()

d1 = {}

d2 = {
    'name': 'John',
    'age': 25,
    'job': 'sfsdfsf',
}

print(d2['name'])
print(d2.get('name'))

# d2.pop(23)
# print(d2)

# print(d2.keys()) - виводить список ключів зі словника

# print(d2.values()) - виводить список значень зі словника

# print(d2.items()) - виводить пару ключ-значення



#додавання елементу в словник

d2['city'] = 'Kyiv'
print(d2)


del d2['age']
print(d2)


t4 = (1,)
print(t4)